Revit 2024 API
IPipeFittingAndAccessoryPressureDropServer.GetDataSchema Method
 Obtains the schema of the ESEntity.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
Schema GetDataSchema()
Visual Basic
Function GetDataSchema As Schema
Visual C++
Schema^ GetDataSchema()
Return Value
 Null if the server has no data.
See Also
IPipeFittingAndAccessoryPressureDropServer Interface
Autodesk.Revit.DB.Plumbing Namespace